{
    "metadata": {
        "created": 1511444586400,
        "version": 2,
        "modified": 1511466039971,
        "url": "https://voyant-tools.org/spyral/76b086434add0e7ea5fd7c504ec57697",
        "previousNotebook": "76b086434add0e7ea5fd7c504ec57697",
        "originalUrl": "4534dd3502bd09e30b5785f4f38bea1d"
    },
    "blocks": [
        {
            "type": "text",
            "input": [
                "<h1 style=\"text-align: center;\">&nbsp;Too Much Information and the KWIC</h1><p s",
                "tyle=\"text-align: center;\">Geoffrey Rockwell and Stéfan Sinclair</p><blockquote ",
                "style=\"margin-left: 50%\"><p>But when they came to letters, This, said Theuth, wi",
                "ll make the Egyptians wiser and give them better memories; it is a specific both",
                " for the memory and for the wit. Thamus replied: O most ingenious Theuth, the pa",
                "rent or inventor of an art is not always the best judge of the utility or inutil",
                "ity of his own inventions to the users of them. (Plato. Phaedrus. Trans. B. Jowe",
                "tt. 274e)</p></blockquote><p>Since Plato’s story of the invention of writing we ",
                "have wanted to hear about technologies to help our memory and to deal with too m",
                "uch information. As Vannevar Bush put the problem in his famous 1945 essay “As W",
                "e May Think”, “There is a growing mountain of research. But there is increased e",
                "vidence that we are being bogged down today as specialization extends.” In what ",
                "is now a standard move when confronting information overload, he went on to prop",
                "ose some technologies that might be solve the problem including the Memex, a pro",
                "to-hypertext research system that anticipated by decades the associative linking",
                " we do with the World Wide Web. As inspiring as the Memex may have been it was n",
                "ot, however, feasible, if only because of the storage technology employed, micro",
                "film. His ideas would wait for computers and digital storage.</p><p>Today, with ",
                "an abundance of technologies like smart phones with cameras for recording everyt",
                "hing and the internet for frictionless distribution, the problem of information ",
                "overload has just gotten worse. Now we don’t only have to worry about the growin",
                "g mountain of research, but also the growing mountain of social media shared by ",
                "our “friends.” Vannevar Bush’s solutions may be a reality, thanks to digital med",
                "ia, but thay have also multiplied the ways information could be captured and dis",
                "tributed, providing yet more information to overload us. Any solution, almost by",
                " its nature, becomes part of the problem.</p><p>It should be clear now that the ",
                "problem of overload has become a trope, or perhaps a excuse tied to the very way",
                " we conceive of information. As Clay Shirky put it in a 2008 talk, “We love this",
                " chart (of the exponential growth of information, and by extension a representat",
                "ion of the problem). … This is why I’m not getting anything done, I’m suffering ",
                "from information overload.” And he then goes on to ask why, if this is the norma",
                "l case, and has been for some time, do we keep on treating it as such a big surp",
                "rise? (The talk is titled “<a data-tabindex-counter=\"13\" data-tabindex-value=\"no",
                "ne\" data-cke-saved-href=\"https://www.youtube.com/watch?v=LabqeJEOQyI\" href=\"http",
                "s://www.youtube.com/watch?v=LabqeJEOQyI\" tabindex=\"-1\" target=\"_blank\">It’s Not ",
                "Information Overload. It’s Filter Failure</a>” and was delivered at the Web 2.0 ",
                "Expo NY.)&nbsp;Why we are still complaining about information overload and then ",
                "proposing new technologies that make it worse? Why are we surprised after Vannev",
                "ar Bush? Haven’t we learned the lesson of the legislator Thamus: that inventors ",
                "and more technologies can’t be trusted for solutions?</p><p>Apparently not, whic",
                "h is why this paper will foolishly try again. It will return to one of the simpl",
                "est and most easily overlooked solutions that is still used today, the Keyword-i",
                "n-Context and see if we can unpack it in a fashion that sheds light on our solut",
                "ionist folly. As Morozon (2013) puts it in the title of his book “<i>To Save Eve",
                "rything, Click Here: The Folly of Technological Solutionism.”</i></p><p>I choose",
                " this particular solution of the KWIC from the 1950s for a number of reasons. Fi",
                "rst, it is far enough in the past that we have the distance needed to make it st",
                "range, something we need to do to appreciate the past as dynamic. Second, becaus",
                "e the KWIC has become one of the framing technologies that we no longer notice l",
                "ike glasses on our nose. Media archaeology is partly about recovering such devel",
                "opments invisible in time. Third, and finally, I will use the development of the",
                " KWIC as an illustration to make an argument about a shift in our conception of ",
                "knowledge made possible by computing. Such shifts are an old story. Developments",
                " like the KWIC are not new. Historians of information technology like Anne Blair",
                " (2010) and Rouse and Rouse (1991) have documented previous and related shifts. ",
                "What may be new is how we think of ours as a knowledge society for which informa",
                "tion overload is symbolic of how we think about about knowledge, both how it is ",
                "conceived and how it is managed.</p><h2>Peter Luhn and the KWIC</h2><p>Let us tu",
                "rn then to the KWIC. In the late 1950s H. P. Luhn developed a technique for auto",
                "matically generating indexes to new information to help deal with what he called",
                " the \"accelerated pace of scientific developments in recent years...\" or informa",
                "tion overload. (Luhn 1966, p. 159) Like Vannevar Bush he looked at the tools use",
                "d then by scientists to handle the flow of information, specifically bibliograph",
                "ic indexes which were used to find relevant information. While Bush was imaginin",
                "g associative hypertexts as a way of managing information, Luhn had the bright i",
                "dea of re-examining what scientists were using indexes for and coming up with a ",
                "type of index that could be generated automatically and therefore circulated in ",
                "a timely fashion to increase its usefulness.</p><p>The problem was that indexes ",
                "in the 1950s were inefficient and couldn’t scale to the growing scientific liter",
                "ature. Indexes then, to be useful, were drawn up by subject specialists by hand ",
                "and were therefore time consuming and expensive to produce. This also meant that",
                " they were not available quickly when they were needed by the scientist trying t",
                "o stay on top of the literature. Luhn conceived of the challenge as one of speed",
                "ing up the production of indexes to support the rapid dissemination of informati",
                "on.</p><blockquote><p class=\"MsoQuote\">In what follows the relationship between ",
                "user and index is examined, and it is shown that for new information, which as i",
                "t appears is only a fraction of the total information accumulated in an area, re",
                "latively rough clues can answer the user's needs. It is then argued that such cl",
                "ues can be generated entirely by machine in the form of a series of extractions ",
                "each containing a significant, or key, word as its nucleus. Samples of indexes c",
                "ompiled entirely by machine methods are presented in support of this argument. (",
                "Luhn 1966, p. 159)</p></blockquote><p>Luhn solved the problem of timely generati",
                "on of indexes by drawing on an older information technology, the concordance. An",
                " index with no context is useful only if you know the work, but for an index of ",
                "new research that is to be used by a scientist to decide what to read, you need ",
                "a bit of context. Concordances that provide a line of context provided the model",
                ". Luhn realized that “relatively rough clues can answer the user’s needs…” and t",
                "hat such rough clues could be generated automatically by a machine. In other wor",
                "ds a Keyword-in-Context that could be generated quickly by machine might be good",
                " enough for an index to current literature in lieu of waiting for the more accur",
                "ate human crafted indexes.</p><p>Here you can see an example of what he called a",
                " Keyword-in-Context (or KWIC).</p><div align=\"center\"><img alt=\"\" data-cke-saved",
                "-src=\"https://raw.githubusercontent.com/sgsinclair/epistemologica/master/data/Lu",
                "hn-kwic/Luhn-kwic.png\" src=\"https://raw.githubusercontent.com/sgsinclair/epistemologi",
                "ca/master/data/Luhn-kwic/Luhn-kwic.png\" style=\"width: 975px; height: 345px;\"><br>Part",
                " of Figure 1 from Luhn 1966</div><p>There are number of things that are interest",
                "ing in Luhn’s development. First, he thought of it as a service not as a technol",
                "ogy. He was trying to imagine a way of disseminating information efficiently by ",
                "taking advantage of what automation (computers) could do and how that could fit ",
                "into then current practices. We now use the grandchildren of the services Luhn p",
                "rototyped.</p><p>Second, as the term \"KWIC\" suggests he was interested in the sp",
                "eedy or “quick” generation and dissemination of information. He still imagined t",
                "hat the KWIC indexes would be printed, but his development would later prove eve",
                "n more useful for the generation of indexes for the screen and interactive use w",
                "hich would be even “quicker”. This is typical of that generation of computing to",
                "ols. They were designed not for use at an interactive screen, but to help automa",
                "te the production of analogue tools like concordances and indexes.</p><p>The cha",
                "llenge that Luhn recognized to quickness was that this only worked if you had al",
                "ready digitized content. (In this case the journal article titles and associated",
                " metadata.) As Luhn put it: “Automatic processing requires that information be a",
                "vailable in machine-readable form.” (Luhn 1966, 164) This was a real problem in ",
                "the 1960 – digitization was expensive. Now things have changed and most informat",
                "ion is born digital and circulates making searching, indexing and abstracting ea",
                "sy. Recovering Luhn reminds us of the stack of infrastructure now deployed.</p><",
                "p>Third, the KWIC worked with a second document, the bibliography and Luhn devel",
                "oped different referencing schemes so that if you found a title you wanted to re",
                "ad you could go to the bibliography, quickly look up the reference so as to be a",
                "ble to get the full document. The KWIC was not only embedded in practices, but a",
                "lso in a network of different types of research tools.</p><p>Fourth, the KWIC de",
                "pends on a visual arrangement of information so that the keywords are lined up m",
                "aking it easier to skim the entries to find those that you want to explore furth",
                "er given the “rough clues.” We tend not to think of concordances and KWICs as vi",
                "sualizations, but their design affordances are visual.</p><p>Lastly, and most im",
                "portantly, the KWIC is an assemblage of texts. It is a new hybrid text that like",
                " Frankenstein’s monster has been assembled from lines of context from other text",
                "s. This recombination of text is not new, as it goes back to the development of ",
                "the concordance in the 13<sup>th</sup> century. (Rouse &amp; Rouse 1991) What Wi",
                "llard McCarty says of the concordance might apply to the KWIC, its computable co",
                "unterpart,</p><p class=\"MsoQuote\">\"By disassembling a text, then reassembling it",
                " as a series of verbal concords, we get a new perspective on it, perhaps even a ",
                "new text. The reconstruction might be thought of as a rearrangement or transform",
                "ation according to a non-linear, discontinuous principle of organization, whethe",
                "r topical, alphabetic, or otherwise.\" (p. 49)</p><p>For us this is significant b",
                "ecause it is in the KWIC that we see a sign of a new fluid way of treating textu",
                "al information as knowledge that can be processed. It is the seed of what was to",
                " come.</p><p>I should also add that it is likely that Luhn was inspired in his d",
                "evelopment of the KWIC by what he knew of another project supported by IBM, name",
                "ly the <i>Index Thomisticus </i>project led by Roberto Busa. Peter Luhn is gener",
                "ally credited with developing the Keyword-in-Context (KWIC) at IBM in the 1960s ",
                "(Fischer 1971), but we know from IBM oral histories that Luhn knew about the dev",
                "elopment of computer-generated concordances from fellow IBM engineer Paul Tasman",
                " who worked on Busa’s project, the first use of computing on unstructured textua",
                "l data. The KWIC thus has its roots in an older humanities technology. What was ",
                "different was that where Busa was trying to refine and automate a traditional re",
                "search tool, Luhn was developing new uses. For example, he also developed a viab",
                "le way of using computers to automatically abstract papers (Luhn 1958).</p><h2>M",
                "aking Knowledge Things</h2><p>At this point I want to move from the simple KWIC ",
                "to a more speculative argument that is illustrated by the KWIC about the nature ",
                "of knowledge in this age.</p><p class=\"MsoQuote\">The nature of knowledge cannot ",
                "survive<b> </b>unchanged within this context of general transformation. It can f",
                "it into the new channels, and become operational, only if learning is translated",
                " into quantities of information. (Lyotard 1986, 4)</p><p>How can we characterize",
                " knowledge in the postmodern age? Lyotard in <i>The Postmodern Condition: A Repo",
                "rt on Knowledge </i>(1986) argues that there has been a transformation in knowle",
                "dge as it has become a quantified commodity. Forms of knowledge that don’t lend ",
                "themselves to being digitized and managed on computers become devalued as relent",
                "less datafication absorbs our culture. In particular narrative knowledge - the c",
                "ultural knowledge of stories small or large increasingly seems valueless as it c",
                "an’t compete with networked data.</p><p>What are the characteristics of this qua",
                "ntified knowledge? First, it is “knowledge-that” not “knowledge-how”, to use a d",
                "istinction Gilbert Ryle made in 1945. Knowledge-that can be represented in discr",
                "ete statements in a language that can be processed. Perhaps it is more appropria",
                "te to call it quantized knowledge as it is more than just numeric data – it is d",
                "ata as representation of knowledge. This knowledge-that is not the knowledge-how",
                " that humans have that cannot be easily externalized, traded, transmitted, or st",
                "ored on a computer. The problem with knowledge-how or the tacit knowledge charac",
                "terized by skill is you can’t easily transfer it or sell it. Skills are undoubte",
                "dly still valued, but less and less so as computing systems approximate skills u",
                "sing databases of knowledge-that and AIs that can supposedly learn from them. Th",
                "e hype has it now that any skill can be reproduced by a computer given enough da",
                "ta and the right algorithms.</p><p>Second, quantized knowledge, because it is di",
                "screte and existing as representations, can therefore be exchanged, measured and",
                " given value. Being quantifiable it can be counted and accounted. Being countabl",
                "e it can be accumulated, measured and sold. That is not to say that it is numeri",
                "c data, in fact, most is linguistic and unstructured, which is an innovation out",
                "lined above – how developments like the KWIC transformed unstructured language s",
                "o that it could become quantized knowledge. The logic of postmodern knowledge is",
                " that only that which can be chunked and accounted for can be valued and only th",
                "at which is valued matters, thereby consigning all other types of knowledge to t",
                "he dust-bin of storytelling.</p><p class=\"MsoQuote\">The indexing and coding tech",
                "niques developed by this method offer a comparatively fast method of literature ",
                "searching, and it appears that the machine-searching application may initiate a ",
                "new era of language engineering. It should certainly lead to improved and more s",
                "ophisticated techniques for use in libraries, chemical documentation, and abstra",
                "ct preparation, as well as in literary analysis. (Tasman 1957, 256)</p><p>Return",
                "ing to the KWIC, we can see how Luhn and others, including Roberto Busa and Paul",
                " Tasman, showed how unstructured textual data could be processed, mixed, and rec",
                "ombined. As Tasman put it in his 1957 article on Literary Data Processing, the t",
                "echnologies they were developing could “initiate a new era of language engineeri",
                "ng.” The KWIC and concording technologies developed for the Busa project showed ",
                "how we could begin to take the cultural record and manipulate it with machines t",
                "o develop hybrid knowledge services with visual interfaces. The KWIC was one in ",
                "a series of technologies starting with simple ways to represent text on punch-ca",
                "rds that showed how knowledge could be datafied and then made useful for new ser",
                "vices. Now, of course, we have gone far beyond the KWIC though we still see trac",
                "es of it in our text analysis tools and search tools, nonetheless it the develop",
                "ments of the 1950s and 1960s that made text something that could be engineered w",
                "hich in turn showed how the computer could be more than a calculator. It could b",
                "e a general purpose knowledge engine capable of treating all knowledge. The extr",
                "aordinary success of datafication in continuously generating novelties starting ",
                "with the KWIC then justified its overwhelming (overloading) dominance over all o",
                "ther stories of knowledge.</p><h2>Knowledge Infrastructure in a Knowledge Societ",
                "y</h2><p>Lyotard’s critique goes deeper than just a discussion of a shift in wha",
                "t we consider knowledge. He wants to outline the characteristics of a knowledge ",
                "society, something we all believe we have achieved and are proud of, especially ",
                "us knowledge workers in the academy. For Lyotard it is a society where all that ",
                "matters is a particular conception of knowledge and that is the knowledge-that w",
                "hich has been datafied so as to be easily accessed, used, bought and stored. Wor",
                "se, the postmodern knowledge society re-structures itself so that knowledge-that",
                " is privileged, foregrounded and commodified in infrastructure. It becomes a kno",
                "wledge-economy where only that which can processed as a commodity is valued and ",
                "only that which is valued is considered knowledge. In inhabiting the knowledge s",
                "ociety we forget other ways of knowledge. The knowledge society trivializes as e",
                "ntertainment all but the narratives or myths that actually define it. As Lyotard",
                " points out, the knowledge society is still justified by stories, because only s",
                "tories can do the work of legitimizing a culture. But, these founding stories be",
                "come givens, like the datafication they justify. The other stories become specta",
                "cle for <i>otaku</i> (or fan cultures). They get atomized into trivia, toys, and",
                " other commodities that can be consumed by fans as a transmedia database of desi",
                "re. As Hiroki Azuma points out, in postmodern culture the grand narratives are f",
                "orgotten and we wallow like animals in the databases of trivial knowledge which ",
                "can endlessly be remixed into quick new hybrid texts that concord (agree) with s",
                "ome use.</p><p>We can now see how information overload is baked into this struct",
                "ure of knowledge. When knowledge has been datafied it has been optimized for eff",
                "icient dissemination way beyond what Peter Luhn dreamed of. The very conception ",
                "of knowledge has been turned into something which treats knowledge as that which",
                " flows at us such that we could be overwhelmed. The knowledge society falls into",
                " the trap of treating its knowledge then as something that must be engineered – ",
                "something of the order that has problems and solutions. When knowledge was knowl",
                "edge of God or of the form of the Good there was no talk of problems and solutio",
                "ns. Now there is nothing but, and information overload is the founding problem –",
                " the recurring myth that frames our knowledge society as one of continuous probl",
                "em solving caused by the very nature of solutionism. The irony noted above is th",
                "at only when you think of knowledge as something coming packaged in problems and",
                " solutions does it become a problem itself that can overload us, calling for yet",
                " more solutions. It is a self-fulfilling myth.</p><h2>Replicating Luhn</h2><p>Wh",
                "at can we do about it? How can we recover a way of thinking that doesn’t just cr",
                "itique the knowledge society, but exposes its structures? Confronted with this s",
                "ystem of datafied knowledge, how can we recover the dignity and distance of Tham",
                "us so we can govern the knowledge society? One way is to reject the datafied way",
                "s and return to the premodern or even modern ways, but those, to be honest, you ",
                "can never really go back. Further, all knowledge regimes frames things, showing ",
                "some and hiding others. Heideggarian nostalgia for lost ways hides its own struc",
                "turing around place and myths of race, a way more dangerous for its unexamined r",
                "ootfulness. Even media archaeology can become a steam-punk fetish of Victorian m",
                "odernity.</p><p>Instead I propose replication as a way that combines media archa",
                "eology (Parikka 2012) with Ian Hacking’s historical ontology (Hacking 2002). Ins",
                "tead of avoiding the technologies around us that structure our ways of knowing, ",
                "why not try to remake them so we can see their workings? Replicating something a",
                "s simple as how to generate Luhn’s KWIC index can be a way of recovering an unde",
                "rstanding of that inflection&nbsp;point when our infrastructure was neither stru",
                "ctured nor below (infra) and out of sight. It opens to view the actual limitatio",
                "ns of these technologies and our understanding of them. It is media archaeology ",
                "because of the attention to actual past technologies that show the structuring b",
                "efore it became hidden in infrastructure. It is historical ontology, or possibly",
                ", historical epistemology, because we are trying to recover ways of knowing thro",
                "ugh historical knowledge things. Things that we call epistemologica – or things ",
                "for knowing and about knowing.</p><p>Making such things is not new. Both the kno",
                "wledge things we replicate and their originals are in a history of demonstration",
                " devices, scientific toys, and other types of apparatus – a form of knowledge me",
                "dia neglected by the discursive disciplines of the humanities that tend not to s",
                "ee making as serious or things as baring knowledge. (Baird 2004) Let me end with",
                " a simple example that will make it clear.</p>"
            ]
        },
        {
            "type": "code",
            "input": [
                "// start by loading the corpus and giving it a local variable name",
                "var oliverTwist;",
                "new Corpus(\"df6f8faf96ec7339a5b0336d69caaf7c\").then(corpus => {",
                "    oliverTwist = corpus;",
                "    oliverTwist.loadContexts({query: \"sir\", limit: 10}).then(contexts => {",
                "        var output = \"<pre>        Keyword-in-Context Bibliographical Index\\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\\n\";",
                "        contexts.each(context => {",
                "        var l = (context.getLeft().substr(-22).padStart(22)+\" \"+context.getMiddle()+context.getRight().substring(0,22)).replace(/\\n/g,\" \").toUpperCase();",
                "            output += l.padEnd(50)+context.getPosition()+\"\\n\";",
                "        });",
                "        show(output+\"</pre>\")",
                "    })",
                "});",
                ""
            ],
            "mode": "javascript",
            "output": [
                "<div style='height: 240px'> <div class=\"info\"><pre>        Keyword-in-Context Bi",
                "bliographical Index\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n   ",
                "AS LONG AS I HAVE,  SIR,          AND HAD THI  1425\nTHAT YOU, MR. BUMBLE,  SIR?'",
                " SAID MRS. MANN,      2741\nAR CHILDREN!  WALK IN  SIR; WALK IN, PRAY, MR. B  287",
                "5\nPRAY, MR. BUMBLE, DO,  SIR.'                      2882\nY VERY EYES, YOU KNOW  ",
                "SIR.'                      3330\nA LITERARY CHARACTER,  SIR!' SAID MRS. MANN.    ",
                "  3602\n        'WHAT'S THAT,  SIR?' INQUIRED POOR OLIVE  4431\n                'Y",
                "ES,  SIR,' REPLIED OLIVER, WEE  4479\n                'YES,  SIR,' STAMMERED THE ",
                "BOY.   4543\n             'PLEASE,  SIR, I WANT SOME MORE.'    5528\n</pre></div><",
                "/div>"
            ]
        },
        {
            "type": "code",
            "input": [
                "// or, simply embed a Voyant Tool (with a different appearance):",
                "oliverTwist.embed(\"Contexts\", {query: \"sir\"});"
            ],
            "mode": "javascript",
            "output": [
                "<div style='height: 418px'> <div class=\"info\"><iframe style=\"width: 90%; height:",
                " 400px\" id=\"ext-135\" name=\"ext-135\" src=\"https://voyant-tools.org/tool/Contexts/",
                "?minimal=true&amp;embeddedApiId=ae1057b80ceb15228317ef1f3415cede&amp;corpus=df6f",
                "8faf96ec7339a5b0336d69caaf7c\" data-tabindex-value=\"none\" tabindex=\"-1\" data-tabi",
                "ndex-counter=\"1\"></iframe></div></div>"
            ]
        },
        {
            "type": "text",
            "input": [
                "<p>This example is one of series of replications Stéfan Sinclair and I have deve",
                "loped using different notebook programming environments including one we have de",
                "veloped ourselves called Spyral that extends Voyant. This notebook let us look c",
                "losely at the KWIC and was the site for our discussing and unpacking the aspects",
                " of KWICs discussed above. Making the notebook becomes a way of interpreting. Th",
                "e notebook programming paradigm is not new and goes back to ideas by Donald Knut",
                "h about “literate programming” (Kunth 1984). Mathematica is probably the best kn",
                "own example of a notebook environment, though these days more and more people ar",
                "e using Jupyter with Python for analytics.</p><p>Notebooks have a number of adva",
                "ntages for the sort of replication we are interested in as they don’t hide the c",
                "ode which generates the process in a black box. Text documenting what you are do",
                "ing, code that can be run step by step, and the output of each step of code, can",
                " all be woven into a narrative in a notebook. You can tell a story of structurin",
                "g. The notebook exposes its instrumentation. It shows how it generates knowledge",
                ". Above you can see a section in a Mathematica notebook where we actually genera",
                "te KWICs. As you can see there is explanation, code and a KWIC. The replication ",
                "lets us focus on the actual processing and how something might have been done&nb",
                "sp;even if we don’t have the original code.</p>"
            ]
        },
        {
            "type": "code",
            "input": "oliverTwist.embed(\"Veliza\", {message: [\"Have you read Oliver Twist?\",\"Concordance of Oliver\"], height: 600});",
            "mode": "javascript",
            "output": [
                "<div style='height: 618px'> <div class=\"info\"><iframe style=\"width: 90%; height:",
                " 600px\" id=\"ext-136\" name=\"ext-136\" src=\"https://voyant-tools.org/tool/Veliza/?m",
                "inimal=true&amp;embeddedApiId=274a88b8fde8efb5be3917410dc87e42&amp;corpus=df6f8f",
                "af96ec7339a5b0336d69caaf7c\" data-tabindex-value=\"none\" tabindex=\"-1\" data-tabind",
                "ex-counter=\"1\"></iframe></div></div>"
            ]
        },
        {
            "type": "text",
            "input": [
                "<p>But isn’t the notebook yet another solution? Doesn’t it just facilitate more ",
                "information to overload you? We think not, at least as we use it, because it fac",
                "ilitates a “reply” or folding back to look closely at exactly what a technology ",
                "does. As we use them, notebooks can facilitate the making strange of technology ",
                "and the judgement of technology rather than its efficient dissemination. It can ",
                "reinterpret a technology, and that is what I hope I have done today, taken a sim",
                "ple technology, replicated it and made it strange so we can see how it is part o",
                "f our datafied infrastructure now.</p><h2>Bibliography</h2><p class=\"Bibliograph",
                "icalReference\">Azuma, H. (2009). <i>Otaku, Japan's Database Animals</i>. Minneap",
                "olis, University of Minnesota Press.</p><p class=\"BibliographicalReference\">Blai",
                "r, A. M. (2010). Too Much To Know: Managing Scholarly Information before the Mod",
                "ern Age. New Haven, Yale University Press.</p><p class=\"BibliographicalReference",
                "\">Blair, A. (2010). \"Information Overload, Then and Now.\" The Chronicle of Highe",
                "r Education. Nov. 28, 2010. &lt;http://www.chronicle.com/article/Information-Ove",
                "rload-Then-and/125479/&gt;</p><p class=\"BibliographicalReference\">Bush, V. (1945",
                "). \"As We May Think.\" Atlantic Monthly. July 1945. 176: 101-108. &lt;https://www",
                ".theatlantic.com/magazine/archive/1945/07/as-we-may-think/303881/&gt;</p><p clas",
                "s=\"BibliographicalReference\">Fischer, Marguerite. (1971). “The KWIC Index Concep",
                "t: A Retrospective View”. Key Papers in Information Science. Ed. Arthur W. Elias",
                ". American Society for Information Science. Pages 121-134.</p><p class=\"Bibliogr",
                "aphicalReference\">Hacking, I. (2002). <i>Historical Ontology</i>. Cambridge, Mas",
                "sachusetts, Harvard University Press.</p><p class=\"BibliographicalReference\">Knu",
                "th, D. E. (1984). \"Literate Programming.\" <i>The Computer Journal.</i> 27:2: 97-",
                "111.</p><p class=\"BibliographicalReference\">Luhn, H. P. (1958). \"The Automatic C",
                "reation of Literature Abstracts.\" <i>IBM Journal</i>. April 1958: 159-165.</p><p",
                " class=\"BibliographicalReference\">Luhn, H. P. (1966). “Keyword-in-Context Index ",
                "for Technical Literature (KWIC Index)”. Readings In Automatic Language Processin",
                "g. Ed. D. G. Hays. New York, American Elsevier Publishing<b>: </b>159-167.</p><p",
                " class=\"BibliographicalReference\">Lyotard, J.-F. (1986). <i>The Postmodern Condi",
                "tion: A Report on Knowledge.</i> Manchester, UK, Manchester University Press.</p",
                "><p class=\"BibliographicalReference\">McCarty, W. (1993). \"Handmade, Computer-ass",
                "isted, and Electronic Concordances of Chaucer.\" <i>CCH Working Papers.</i> 3: 49",
                "-65.</p><p class=\"BibliographicalReference\">Morozov, E. (2013). <i>To Save Every",
                "thing, Click Here: The Folly of Technological Solutionism</i>. New York, Public ",
                "Affairs.</p><p class=\"BibliographicalReference\">Parikka, J. (2012). <i>What is M",
                "edia Archaeology?</i> Cambridge, UK, Polity.</p><p class=\"BibliographicalReferen",
                "ce\">Rouse, M. A. and R. H. Rouse (1991). “The Development of Research Tools in t",
                "he Thirteenth Century.” Authentic Witnesses: Approaches to Medieval Texts and Ma",
                "nuscripts. Notre Dame, Indiana, University of Notre Dame Press.</p><p class=\"Bib",
                "liographicalReference\">Ryle, G. (1945-46). \"Knowing How and Knowing That: The Pr",
                "esidential Address.\" <i>Proceedings of the Aristotelian Society</i>. 46: 1-16.</",
                "p><p class=\"BibliographicalReference\">Tasman, P. (1957). \"Literary Data Processi",
                "ng.\" <i>IBM Journal of Research and Development</i><b>. </b>1:3: 249-256.</p>"
            ]
        }
    ]
}
